Praveen-Mukri/MCU_DRIVER_DEVELOPMENT/STM32f446RE_drivers/Src/004SPI_Tx_Testing.c
/*
 * 004SPI_Tx_Testing.c
 *
 *  Created on: 10-Oct-2020
 *      Author: praveen mukri
 */

#include "STM32F446RE_gpio_driver.h"
#include "STM32F446RE_spi_driver.h"
#include "string.h"
/*
 * PB14 --> SPI2_MISO
 * PB15 --> SPI2_MOSI
 * PB13 --> SPI2_SCLK
 * PB12 --> SPI2_NSS
 *  ALT function mode : 5
 */
void SPI2_GPIOInits(void)
{
    GPIO_Handle_t SPIPins;

    SPIPins.pGPIOx = GPIOB;
    SPIPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
    SPIPins.GPIO_PinConfig.GPIO_PinAltFunction = 5;
    SPIPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_NO_PUPD;
    SPIPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

    //SCLK
    SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
    GPIO_Init(&SPIPins);

    //MOSI
    SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
    GPIO_Init(&SPIPins);

    //MISO
    SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
    GPIO_Init(&SPIPins);

    //NSS
    SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
    GPIO_Init(&SPIPins);
}

void SPI2_Init()
{

    SPI_Handle_t SPI2Handle;

    SPI2Handle.pSPIx = SPI2;
    SPI2Handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
    SPI2Handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
    SPI2Handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV2;
    SPI2Handle.SPIConfig.SPI_DFF = SPI_DFF_8BITS;
    SPI2Handle.SPIConfig.SPI_CPOL = SPI_CPOL_LOW;
    SPI2Handle.SPIConfig.SPI_CPHA = SPI_CPHA_LOW;
    SPI2Handle.SPIConfig.SPI_SSM = SPI_SSM_EN;

    SPI_Init(&SPI2Handle);
}


int main(void)
{
    char user_Data[] = "Hello world";
    // initialize the GPIO pins to behave as a SPI pins
    SPI2_GPIOInits();

    // Initialize SPI configuration
    SPI2_Init();

    // Enable SPI peripheral
    SPI_PeripheralControl(SPI2,ENABLE);

    // Send data
    SPI_SendData(SPI2, (uint8_t*) user_Data, strlen(user_Data));

    while(1);

    return 0;
}
